zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/misc/renesas/ra-elc/ra8m1-elc.h
#define RA_ELC_EVENT_CAN1_COMFRX             0x196 /**< Common FIFO receive interrupt. */
#define RA_ELC_EVENT_CAN1_CF_DMAREQ          0x197 /**< Channel  DMA request. */
#define RA_ELC_EVENT_CAN1_RXMB               0x198 /**< Receive message buffer interrupt. */
#define RA_ELC_EVENT_CAN0_MRAM_ERI           0x19B /**< CANFD0 ECC error. */
#define RA_ELC_EVENT_CAN1_MRAM_ERI           0x19C /**< CANFD1 ECC error. */
#define RA_ELC_EVENT_I3C0_RESPONSE           0x19D /**< Response status buffer full. */
#define RA_ELC_EVENT_I3C0_COMMAND            0x19E /**< Command buffer empty. */
#define RA_ELC_EVENT_I3C0_IBI                0x19F /**< IBI status buffer full. */
#define RA_ELC_EVENT_I3C0_RX                 0x1A0 /**< Receive. */
#define RA_ELC_EVENT_IICB0_RXI               0x1A0 /**< Receive. */
#define RA_ELC_EVENT_I3C0_TX                 0x1A1 /**< Transmit. */
#define RA_ELC_EVENT_IICB0_TXI               0x1A1 /**< Transmit. */
#define RA_ELC_EVENT_I3C0_RCV_STATUS         0x1A2 /**< Receive status buffer full. */
#define RA_ELC_EVENT_I3C0_HRESP              0x1A3 /**< High priority response queue full. */
#define RA_ELC_EVENT_I3C0_HCMD               0x1A4 /**< High priority command queue empty. */
#define RA_ELC_EVENT_I3C0_HRX                0x1A5 /**< High priority rx data buffer full. */
#define RA_ELC_EVENT_I3C0_HTX                0x1A6 /**< High priority tx data buffer empty. */
#define RA_ELC_EVENT_I3C0_TEND               0x1A7 /**< Transmit end. */
#define RA_ELC_EVENT_IICB0_TEI               0x1A7 /**< Transmit end. */
#define RA_ELC_EVENT_I3C0_EEI                0x1A8 /**< Error. */
#define RA_ELC_EVENT_IICB0_ERI               0x1A8 /**< Error. */
#define RA_ELC_EVENT_I3C0_STEV               0x1A9 /**< Synchronous timing. */
#define RA_ELC_EVENT_I3C0_MREFOVF            0x1AA /**< MREF counter overflow. */
#define RA_ELC_EVENT_I3C0_MREFCPT            0x1AB /**< MREF capture. */
#define RA_ELC_EVENT_I3C0_AMEV               0x1AC /**< Additional master-initiated bus event. */
#define RA_ELC_EVENT_I3C0_WU                 0x1AD /**< Wake-up Condition Detection interrupt. */
#define RA_ELC_EVENT_ADC0_SCAN_END           0x1AE /**< End of A/D scanning operation. */
#define RA_ELC_EVENT_ADC0_SCAN_END_B         0x1AF /**< A/D scan end interrupt for group B. */
#define RA_ELC_EVENT_ADC0_WINDOW_A           0x1B0 /**< Window A Compare match interrupt. */
#define RA_ELC_EVENT_ADC0_WINDOW_B           0x1B1 /**< Window B Compare match interrupt. */
#define RA_ELC_EVENT_ADC0_COMPARE_MATCH      0x1B2 /**< Compare match. */
#define RA_ELC_EVENT_ADC0_COMPARE_MISMATCH   0x1B3 /**< Compare mismatch. */
#define RA_ELC_EVENT_ADC1_SCAN_END           0x1B4 /**< End of A/D scanning operation. */
#define RA_ELC_EVENT_ADC1_SCAN_END_B         0x1B5 /**< A/D scan end interrupt for group B. */
#define RA_ELC_EVENT_ADC1_WINDOW_A           0x1B6 /**< Window A Compare match interrupt. */
#define RA_ELC_EVENT_ADC1_WINDOW_B           0x1B7 /**< Window B Compare match interrupt. */
#define RA_ELC_EVENT_ADC1_COMPARE_MATCH      0x1B8 /**< Compare match. */
#define RA_ELC_EVENT_ADC1_COMPARE_MISMATCH   0x1B9 /**< Compare mismatch. */
#define RA_ELC_EVENT_DOC_INT                 0x1BA /**< Data operation circuit interrupt. */
#define RA_ELC_EVENT_RSIP_TADI               0x1BC /**< RSIP Tamper Detection. */
#define RA_ELC_EVENT_CEU_CEUI                0x1DA /**< CEU interrupt. */

/* Renesas RA ELC peripherals that can be linked to event signals. */
#define RA_ELC_PERIPHERAL_GPT_A   0  /**< General PWM Timer A */
#define RA_ELC_PERIPHERAL_GPT_B   1  /**< General PWM Timer B */
#define RA_ELC_PERIPHERAL_GPT_C   2  /**< General PWM Timer C */
#define RA_ELC_PERIPHERAL_GPT_D   3  /**< General PWM Timer D */
#define RA_ELC_PERIPHERAL_GPT_E   4  /**< General PWM Timer E */
#define RA_ELC_PERIPHERAL_GPT_F   5  /**< General PWM Timer F */
#define RA_ELC_PERIPHERAL_GPT_G   6  /**< General PWM Timer G */
#define RA_ELC_PERIPHERAL_GPT_H   7  /**< General PWM Timer H */
#define RA_ELC_PERIPHERAL_ADC0    8  /**< ADC0 */
#define RA_ELC_PERIPHERAL_ADC0_B  9  /**< ADC0 Group B */
#define RA_ELC_PERIPHERAL_ADC1    10 /**< ADC1 */
#define RA_ELC_PERIPHERAL_ADC1_B  11 /**< ADC1 Group B */
#define RA_ELC_PERIPHERAL_DAC0    12 /**< DAC0 */
#define RA_ELC_PERIPHERAL_DAC1    13 /**< DAC1 */
#define RA_ELC_PERIPHERAL_IOPORT1 14 /**< IOPORT1 */
#define RA_ELC_PERIPHERAL_IOPORT2 15 /**< IOPORT2 */
#define RA_ELC_PERIPHERAL_IOPORT3 16 /**< IOPORT3 */
#define RA_ELC_PERIPHERAL_IOPORT4 17 /**< IOPORT4 */
#define RA_ELC_PERIPHERAL_I3C     30 /**< I3C */

/** @endcond */

/** @} */

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_MISC_RENESAS_RA_ELC_RA8M1_ELC_H_ */
